In [1]:
# Homwework due on week 2 Thursday

In [3]:
# Homework based on https://www.kaggle.com/learn/pandas

# Lesson 1 - Creating, Reading and Writing

In [135]:
# importing Pandas
import pandas as pd

### <span style='color:red'> *Creating data* </span>

In [5]:
pd.DataFrame({'Yes': [50,21], 'No': [131,2]})

   Yes   No
0   50  131
1   21    2

In [7]:
pd.DataFrame({'Bob': ['I liked it.','It was awful.'], 'Sue': ['Pretty good.','Bland.']})

             Bob           Sue
0    I liked it.  Pretty good.
1  It was awful.        Bland.

In [9]:
# manipulating index
pd.DataFrame({'Bob': ['I liked it.','It was awful.'], 'Sue': ['Pretty good.','Bland.']}, index=['Product A','Product B'])

                     Bob           Sue
Product A    I liked it.  Pretty good.
Product B  It was awful.        Bland.

In [11]:
pd.Series([1, 2, 3, 4, 5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [13]:
pd.Series([30, 35, 40], index=['2015 Sales', '2016 Sales', '2017 Sales'], name='Product A')

2015 Sales    30
2016 Sales    35
2017 Sales    40
Name: Product A, dtype: int64

In [18]:
import os

In [26]:
os.chdir('/Users/jinyang/Desktop/Institute_of_Data/IOD_2020_Github/data/')

In [106]:
df = pd.read_csv('housing-data.csv')

In [107]:
df.shape

(47, 4)

In [108]:
df.head()

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900

In [72]:
df = pd.read_csv('housing-data.csv', index_col=0)
df.head()

      bdrms  age   price
sqft
2104      3   70  399900
1600      3   28  329900
2400      3   44  369000
1416      2   49  232000
3000      4   75  539900

In [80]:
df = pd.read_csv('housing-data.csv')

### <span style='color:red'> ***Indexing, Selecting & Assigning*** </span>

In [81]:
df.head()

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900

In [82]:
df.price.head()

0    399900
1    329900
2    369000
3    232000
4    539900
Name: price, dtype: int64

In [83]:
df['price'].head()

0    399900
1    329900
2    369000
3    232000
4    539900
Name: price, dtype: int64

In [87]:
df['price'][0]

399900

In [89]:
df.iloc[0]

sqft       2104
bdrms         3
age          70
price    399900
Name: 0, dtype: int64

In [91]:
df.iloc[:,0].head()

0    2104
1    1600
2    2400
3    1416
4    3000
Name: sqft, dtype: int64

In [92]:
df.iloc[:3, 0]

0    2104
1    1600
2    2400
Name: sqft, dtype: int64

In [94]:
df.iloc[1:3, 0]

1    1600
2    2400
Name: sqft, dtype: int64

In [95]:
df.iloc[[0,1,2],0]

0    2104
1    1600
2    2400
Name: sqft, dtype: int64

In [96]:
df.iloc[-5:]

    sqft  bdrms  age   price
42  2567      4   57  314000
43  1200      3   76  299000
44   852      2   70  179900
45  1852      4   64  299900
46  1203      3   11  239500

In [97]:
df.loc[0,'price']

399900

In [99]:
df.loc[:, ['sqft','bdrms','age']].head()

   sqft  bdrms  age
0  2104      3   70
1  1600      3   28
2  2400      3   44
3  1416      2   49
4  3000      4   75

In [101]:
df.set_index('sqft').head()

      bdrms  age   price
sqft
2104      3   70  399900
1600      3   28  329900
2400      3   44  369000
1416      2   49  232000
3000      4   75  539900

In [110]:
df.bdrms == 3

0      True
1      True
2      True
3     False
4     False
5     False
6      True
7      True
8      True
9      True
10    False
11     True
12     True
13    False
14     True
15    False
16    False
17     True
18    False
19    False
20     True
21    False
22     True
23    False
24     True
25     True
26     True
27     True
28     True
29     True
30    False
31    False
32    False
33     True
34    False
35     True
36     True
37    False
38    False
39    False
40    False
41     True
42    False
43     True
44    False
45    False
46     True
Name: bdrms, dtype: bool

In [111]:
df.loc[df.bdrms == 3]

    sqft  bdrms  age   price
0   2104      3   70  399900
1   1600      3   28  329900
2   2400      3   44  369000
6   1534      3   12  314900
7   1427      3   57  198999
8   1380      3   14  212000
9   1494      3   15  242500
11  2000      3   27  347000
12  1890      3   45  329999
14  1268      3   58  259900
17  1236      3   78  199900
20  1767      3   44  252900
22  1604      3   13  242900
24  3890      3   36  573900
25  1100      3   60  249900
26  1458      3   29  464500
27  2526      3   13  469000
28  2200      3   28  475000
29  2637      3   25  299900
33  3137      3   67  579900
35  1437      3   50  249900
36  1239      3   22  229900
41  2238      3   37  329900
43  1200      3   76  299000
46  1203      3   11  239500

In [113]:
df.loc[(df.bdrms == 3) & (df.age >= 50)]

    sqft  bdrms  age   price
0   2104      3   70  399900
7   1427      3   57  198999
14  1268      3   58  259900
17  1236      3   78  199900
25  1100      3   60  249900
33  3137      3   67  579900
35  1437      3   50  249900
43  1200      3   76  299000

In [114]:
df.loc[(df.bdrms == 3) | (df.age >= 50)]

    sqft  bdrms  age   price
0   2104      3   70  399900
1   1600      3   28  329900
2   2400      3   44  369000
4   3000      4   75  539900
5   1985      4   61  299900
6   1534      3   12  314900
7   1427      3   57  198999
8   1380      3   14  212000
9   1494      3   15  242500
11  2000      3   27  347000
12  1890      3   45  329999
14  1268      3   58  259900
15  2300      4   77  449900
16  1320      2   62  299900
17  1236      3   78  199900
20  1767      3   44  252900
21  1888      2   79  255000
22  1604      3   13  242900
23  1962      4   53  259900
24  3890      3   36  573900
25  1100      3   60  249900
26  1458      3   29  464500
27  2526      3   13  469000
28  2200      3   28  475000
29  2637      3   25  299900
32  2040      4   75  314900
33  3137      3   67  579900
35  1437      3   50  249900
36  1239      3   22  229900
38  4215      4   66  549000
41  2238      3   37  329900
42  2567      4   57  314000
43  1200      3   76  299000
44   852      2   70  179900
45  1852      4   64  299900
46  1203      3   11  239500

In [116]:
df.loc[df.bdrms.isin([4,5])]

    sqft  bdrms  age   price
4   3000      4   75  539900
5   1985      4   61  299900
10  1940      4    7  239999
13  4478      5   49  699900
15  2300      4   77  449900
18  2609      4    5  499998
19  3031      4   21  599000
23  1962      4   53  259900
32  2040      4   75  314900
34  1811      4   24  285900
37  2132      4   28  345000
38  4215      4   66  549000
39  2162      4   43  287000
42  2567      4   57  314000
45  1852      4   64  299900

In [124]:
df.loc[df.price.notnull()].head()

   sqft  bdrms  age   price    critic  index_backwards
0  2104      3   70  399900  everyone               47
1  1600      3   28  329900  everyone               46
2  2400      3   44  369000  everyone               45
3  1416      2   49  232000  everyone               44
4  3000      4   75  539900  everyone               43

In [123]:
df['critic'] = 'everyone'
df['critic'].head()

0    everyone
1    everyone
2    everyone
3    everyone
4    everyone
Name: critic, dtype: object

In [122]:
df['index_backwards'] = range(len(df), 0, -1)
df['index_backwards'].head()

0    47
1    46
2    45
3    44
4    43
Name: index_backwards, dtype: int64

### <span style='color:red'> ***Summary Functions and Maps*** </span>

In [126]:
df.head()

   sqft  bdrms  age   price    critic  index_backwards
0  2104      3   70  399900  everyone               47
1  1600      3   28  329900  everyone               46
2  2400      3   44  369000  everyone               45
3  1416      2   49  232000  everyone               44
4  3000      4   75  539900  everyone               43

In [129]:
df.age.describe()

count    47.000000
mean     42.744681
std      22.873440
min       5.000000
25%      24.500000
50%      44.000000
75%      61.500000
max      79.000000
Name: age, dtype: float64

In [130]:
df.price.describe()

count        47.000000
mean     340412.659574
std      125039.899586
min      169900.000000
25%      249900.000000
50%      299900.000000
75%      384450.000000
max      699900.000000
Name: price, dtype: float64

In [131]:
df.age.mean()

42.744680851063826

In [132]:
df.bdrms.unique()

array([3, 2, 4, 5, 1])

In [133]:
df.bdrms.value_counts()

3    25
4    14
2     6
5     1
1     1
Name: bdrms, dtype: int64

In [134]:
df_age_mean = df.age.mean()
df.age.map(lambda p: p - df_age_mean)

0     27.255319
1    -14.744681
2      1.255319
3      6.255319
4     32.255319
5     18.255319
6    -30.744681
7     14.255319
8    -28.744681
9    -27.744681
10   -35.744681
11   -15.744681
12     2.255319
13     6.255319
14    15.255319
15    34.255319
16    19.255319
17    35.255319
18   -37.744681
19   -21.744681
20     1.255319
21    36.255319
22   -29.744681
23    10.255319
24    -6.744681
25    17.255319
26   -13.744681
27   -29.744681
28   -14.744681
29   -17.744681
30    -2.744681
31   -37.744681
32    32.255319
33    24.255319
34   -18.744681
35     7.255319
36   -20.744681
37   -14.744681
38    23.255319
39     0.255319
40    -2.744681
41    -5.744681
42    14.255319
43    33.255319
44    27.255319
45    21.255319
46   -31.744681
Name: age, dtype: float64

In [138]:
def remean_points(row):
    row.age = row.age - df_age_mean
    return row
df.apply(remean_points, axis='columns')

    sqft  bdrms        age   price    critic  index_backwards
0   2104      3  27.255319  399900  everyone               47
1   1600      3 -14.744681  329900  everyone               46
2   2400      3   1.255319  369000  everyone               45
3   1416      2   6.255319  232000  everyone               44
4   3000      4  32.255319  539900  everyone               43
5   1985      4  18.255319  299900  everyone               42
6   1534      3 -30.744681  314900  everyone               41
7   1427      3  14.255319  198999  everyone               40
8   1380      3 -28.744681  212000  everyone               39
9   1494      3 -27.744681  242500  everyone               38
10  1940      4 -35.744681  239999  everyone               37
11  2000      3 -15.744681  347000  everyone               36
12  1890      3   2.255319  329999  everyone               35
13  4478      5   6.255319  699900  everyone               34
14  1268      3  15.255319  259900  everyone               33
15  2300      4  34.255319  449900  everyone               32
16  1320      2  19.255319  299900  everyone               31
17  1236      3  35.255319  199900  everyone               30
18  2609      4 -37.744681  499998  everyone               29
19  3031      4 -21.744681  599000  everyone               28
20  1767      3   1.255319  252900  everyone               27
21  1888      2  36.255319  255000  everyone               26
22  1604      3 -29.744681  242900  everyone               25
23  1962      4  10.255319  259900  everyone               24
24  3890      3  -6.744681  573900  everyone               23
25  1100      3  17.255319  249900  everyone               22
26  1458      3 -13.744681  464500  everyone               21
27  2526      3 -29.744681  469000  everyone               20
28  2200      3 -14.744681  475000  everyone               19
29  2637      3 -17.744681  299900  everyone               18
30  1839      2  -2.744681  349900  everyone               17
31  1000      1 -37.744681  169900  everyone               16
32  2040      4  32.255319  314900  everyone               15
33  3137      3  24.255319  579900  everyone               14
34  1811      4 -18.744681  285900  everyone               13
35  1437      3   7.255319  249900  everyone               12
36  1239      3 -20.744681  229900  everyone               11
37  2132      4 -14.744681  345000  everyone               10
38  4215      4  23.255319  549000  everyone                9
39  2162      4   0.255319  287000  everyone                8
40  1664      2  -2.744681  368500  everyone                7
41  2238      3  -5.744681  329900  everyone                6
42  2567      4  14.255319  314000  everyone                5
43  1200      3  33.255319  299000  everyone                4
44   852      2  27.255319  179900  everyone                3
45  1852      4  21.255319  299900  everyone                2
46  1203      3 -31.744681  239500  everyone                1

In [139]:
df.head(1)

   sqft  bdrms  age   price    critic  index_backwards
0  2104      3   70  399900  everyone               47

In [140]:
df_age_mean = df.age.mean()
df.age - df_age_mean

0     27.255319
1    -14.744681
2      1.255319
3      6.255319
4     32.255319
5     18.255319
6    -30.744681
7     14.255319
8    -28.744681
9    -27.744681
10   -35.744681
11   -15.744681
12     2.255319
13     6.255319
14    15.255319
15    34.255319
16    19.255319
17    35.255319
18   -37.744681
19   -21.744681
20     1.255319
21    36.255319
22   -29.744681
23    10.255319
24    -6.744681
25    17.255319
26   -13.744681
27   -29.744681
28   -14.744681
29   -17.744681
30    -2.744681
31   -37.744681
32    32.255319
33    24.255319
34   -18.744681
35     7.255319
36   -20.744681
37   -14.744681
38    23.255319
39     0.255319
40    -2.744681
41    -5.744681
42    14.255319
43    33.255319
44    27.255319
45    21.255319
46   -31.744681
Name: age, dtype: float64